In [1]:
# Write a python code to create a .csv file
import pandas as pd

In [2]:
data = {
    'emp_id' : [101,102,103,104],
    'emp_name' : ['Aman','Deepak','Deva','Gopi'],
    'departement':['Developement','Management','Testing','HR'],
    'salary':[1500000,1200000,230000,980000]
}

df = pd.DataFrame(data)
# df or print(df)
df

   emp_id emp_name   departement   salary
0     101     Aman  Developement  1500000
1     102   Deepak    Management  1200000
2     103     Deva       Testing   230000
3     104     Gopi            HR   980000

In [3]:
df.to_csv('employee.csv',index=False)
print('Data is saved successfully')

Data is saved successfully

In [4]:
# How to read csv file ?
# Read .csv file

newDf = pd.read_csv('student_info.csv')
newDf

     study_hours  student_marks
0           6.83          78.50
1           6.56          76.74
2            NaN          78.68
3           5.67          71.82
4           8.67          84.19
..           ...            ...
195         7.53          81.67
196         8.56          84.68
197         8.94          86.75
198         6.60          78.05
199         8.35          83.50

[200 rows x 2 columns]

In [5]:
print(pd)

<module 'pandas' from '/usr/local/lib/python3.6/dist-packages/pandas/__init__.py'>

In [6]:
print(df.dtypes)

emp_id          int64
emp_name       object
departement    object
salary          int64
dtype: object

In [7]:
print(df.index)

RangeIndex(start=0, stop=4, step=1)

In [8]:
print(df.values)

[[101 'Aman' 'Developement' 1500000]
 [102 'Deepak' 'Management' 1200000]
 [103 'Deva' 'Testing' 230000]
 [104 'Gopi' 'HR' 980000]]

In [9]:
# Shape property of DataFrame is use to display shape

newDf.shape

(200, 2)

In [10]:
# head() :- head() of DataFrame display top 5 rows

newDf.head()

   study_hours  student_marks
0         6.83          78.50
1         6.56          76.74
2          NaN          78.68
3         5.67          71.82
4         8.67          84.19

In [11]:
# tail() :- tail() function of DataFrame display last five rows 
newDf.tail()

     study_hours  student_marks
195         7.53          81.67
196         8.56          84.68
197         8.94          86.75
198         6.60          78.05
199         8.35          83.50

In [12]:
# series :- series is a data structure in pandas . It work like one dimensional array
import numpy as np

In [13]:
series = pd.Series(np.random.rand(50))
series

0     0.553548
1     0.314558
2     0.583479
3     0.295450
4     0.662494
5     0.375746
6     0.766845
7     0.266626
8     0.222149
9     0.117993
10    0.052580
11    0.455035
12    0.419436
13    0.983748
14    0.976926
15    0.350122
16    0.497044
17    0.558946
18    0.793699
19    0.776098
20    0.350097
21    0.501095
22    0.309631
23    0.796566
24    0.945414
25    0.445265
26    0.229583
27    0.756064
28    0.243059
29    0.430218
30    0.519476
31    0.303220
32    0.742607
33    0.343111
34    0.274894
35    0.493500
36    0.117732
37    0.205414
38    0.500804
39    0.509732
40    0.683807
41    0.805925
42    0.367451
43    0.298784
44    0.489369
45    0.715331
46    0.160563
47    0.048944
48    0.004630
49    0.431113
dtype: float64

In [14]:
type(series)

pandas.core.series.Series

In [15]:
dataframe = pd.DataFrame(np.random.rand(100,5))
dataframe

           0         1         2         3         4
0   0.817449  0.613258  0.519053  0.557948  0.232567
1   0.330358  0.824405  0.650076  0.039183  0.614040
2   0.271544  0.320652  0.324113  0.316722  0.620397
3   0.527003  0.310929  0.378928  0.084944  0.051673
4   0.254840  0.360742  0.345501  0.946256  0.365885
..       ...       ...       ...       ...       ...
95  0.531029  0.673797  0.815120  0.707112  0.767008
96  0.067851  0.268685  0.656480  0.637019  0.129766
97  0.391948  0.399123  0.129934  0.199404  0.475412
98  0.120537  0.414469  0.342938  0.976405  0.048387
99  0.195074  0.735257  0.369894  0.964990  0.504173

[100 rows x 5 columns]

In [23]:
dataframe = pd.DataFrame({
    'number': np.random.rand(5),
    'marks':np.random.rand(5)
})
dataframe

     number     marks
0  0.553551  0.830761
1  0.836790  0.853722
2  0.497512  0.526348
3  0.589156  0.919841
4  0.846799  0.007471

In [17]:
dataframe.dtypes

number    float64
dtype: object

In [18]:
dataframe.head()

     number
0  0.161292
1  0.992237
2  0.742173
3  0.946816
4  0.370574

In [19]:
newDf.describe()

       study_hours  student_marks
count   195.000000      200.00000
mean      6.995949       77.93375
std       1.253060        4.92570
min       5.010000       68.57000
25%       5.775000       73.38500
50%       7.120000       77.71000
75%       8.085000       82.32000
max       8.990000       86.99000

In [20]:
# How to read xlsx file

excelData = pd.read_excel('students.xlsx', engine='openpyxl')
excelData

   Roll_No    Name    Fee
0     1001   Rohit  50000
1     1002   Mohit  40000
2     1003  Sobhit  55000
3     1004   Mudit  56000